# NumTriangles Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..NumTriangles Property
Mesh Class See Also
---
The number of triangles that the mesh contains.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumTriangles { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumTriangles As Integer
	Get
```

Visual C++
---
```text
public:
property int NumTriangles {
	int get ();
}
```

# See Also
Mesh Class
Autodesk.Revit.DB Namespace